const numbers = [
    { 0: '*****', 1: '    *', 2: '*****', 3: '*****', 4: '*   *', 5: '*****', 6: '*****', 7: '*****', 8: '*****', 9: '*****', _: '     ' },
    { 0: '*   *', 1: '    *', 2: '    *', 3: '    *', 4: '*   *', 5: '*    ', 6: '*    ', 7: '    *', 8: '*   *', 9: '*   *', _: '     ' },
    { 0: '*   *', 1: '    *', 2: '*****', 3: '*****', 4: '*****', 5: '*****', 6: '*****', 7: '    *', 8: '*****', 9: '*****', _: '  *  ' },
    { 0: '*   *', 1: '    *', 2: '*    ', 3: '    *', 4: '    *', 5: '    *', 6: '*   *', 7: '    *', 8: '*   *', 9: '    *', _: '     ' },
    { 0: '*****', 1: '    *', 2: '*****', 3: '*****', 4: '    *', 5: '*****', 6: '*****', 7: '    *', 8: '*****', 9: '*****', _: '  *  ' }
];

export const printLargeNumber = (day, month, year) => {
    // Превращаем число в строку, а затем в массив отдельных цифр: 26 -> ['2', '6']
    let strDay = day < 10 ? `0${String(day)}` : String(day);
    let strMonth = month < 10 ? `0${String(month)}` : String(month);
    const digits = (strDay + '_' + strMonth + '_' + String(year)).split('');

    // Перебираем 5 строк матрицы
    for (let row = 0; row < 5; row++) {
        let line = '';

        // Для текущей строки собираем кусочки от каждой цифры
        for (let digit of digits) {
            // Добавляем пробел между цифрами, чтобы они не слипались
            line += numbers[row][digit] + '  ';
        }

        console.log(line);
    }
};